Revit 2026 API

# CheckerTextureWAngle Property

---

The property labeled "Rotation" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureWAngle { get; }
```
```vb
Public Shared ReadOnly Property TextureWAngle As String
	Get
```
```cpp
public:
static property String^ TextureWAngle {
	String^ get ();
}
```
```fsharp
static member TextureWAngle : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 360".

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace